Melting/defense/003_mel_yHa100_1d/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    upperWall      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    leftWall     
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    rightWall     
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    lowerWall     
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
